In [7]:
import sys
import os
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns


current_path = '/Users/ericklopez/Desktop/Developing_and_Deploying_a_Predictive_Analytics_Platform_Using_FastAPI_Streamlit_and_Docker/empirical/notebooks/data_visualizations.ipynb'
sys.path.insert(0, os.path.dirname(os.path.dirname(current_path)))

In [8]:
fpath = os.path.join(os.path.abspath('..'), 'data', 'processed', 'cleaned_car_data.csv')
df = pd.read_csv(fpath)
df_copy = df.copy()
col = ['Unnamed: 0']
df_copy.drop(columns=col, inplace=True)
df_copy.head()

                     name  year fuel_type automaker  miles_driven        price
0     Hyundai Santro Xing  2007    Petrol   Hyundai         27962   952.380952
1     Mahindra Jeep CL550  2006    Diesel  Mahindra            25  5059.523810
2      Maruti Suzuki Alto  2018    Petrol    Maruti         13670     0.000000
3       Hyundai Grand i10  2014    Petrol   Hyundai         17398  3869.047619
4  Ford EcoSport Titanium  2014    Diesel      Ford         22369  6845.238095

In [9]:
df_copy.head()

                     name  year fuel_type automaker  miles_driven        price
0     Hyundai Santro Xing  2007    Petrol   Hyundai         27962   952.380952
1     Mahindra Jeep CL550  2006    Diesel  Mahindra            25  5059.523810
2      Maruti Suzuki Alto  2018    Petrol    Maruti         13670     0.000000
3       Hyundai Grand i10  2014    Petrol   Hyundai         17398  3869.047619
4  Ford EcoSport Titanium  2014    Diesel      Ford         22369  6845.238095

In [10]:
values_to_drop = [0]

df_filtered = df_copy[~df_copy['price'].isin(values_to_drop)]
# df_filtered = df_filtered.rename(columns={'Price_converted':'price'})

values_to_drop2 = ['Mahindra', 'Maruti', 'Skoda', 'Renault', 'Datsun', 'Tata', 'Hindustan', 'Force', 'Land']
df_filtered = df_filtered[~df_filtered['automaker'].isin(values_to_drop2)]

Extracting Training Data

In [11]:
x = df_filtered[['name', 'automaker', 'year', 'miles_driven', 'fuel_type']]
y = df_filtered['price']

In [12]:
x

                       name  automaker  year  miles_driven fuel_type
0       Hyundai Santro Xing    Hyundai  2007         27962    Petrol
3         Hyundai Grand i10    Hyundai  2014         17398    Petrol
4    Ford EcoSport Titanium       Ford  2014         22369    Diesel
6                 Ford Figo       Ford  2012         25476    Diesel
7               Hyundai Eon    Hyundai  2013         15534    Petrol
..                      ...        ...   ...           ...       ...
827            Hyundai Getz    Hyundai  2006         49710    Petrol
828         Mercedes Benz C   Mercedes  2006          9321    Petrol
835    Toyota Corolla Altis     Toyota  2009         82021    Petrol
838         Honda Amaze 1.2      Honda  2014             0       NaN
839      Chevrolet Sail 1.2  Chevrolet  2014             0       NaN

[374 rows x 5 columns]

Applying Train Test Split